<a href="https://colab.research.google.com/github/KomalMano/Story/blob/master/6_Handle_missing_data_replace_function.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [47]:
import pandas as pd
from google.colab import files
import numpy as np
import io

In [48]:
uploaded = files.upload()

Saving latest_weather_data.csv to latest_weather_data (4).csv

In [49]:

for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

User uploaded file "latest_weather_data.csv" with length 192 bytes

In [50]:
uploaded

{'latest_weather_data.csv': b'day,temp,windspeed,event\r\n1/1/2017,32 F,6 mph,Rain\r\n1/2/2017,-99999,7 mph,Sunny\r\n1/3/2017,28,-99999,Snow\r\n1/4/2017,-99999,7,0\r\n1/5/2017,32 C,-88888,Rain\r\n1/6/2017,31,2,Sunny\r\n1/6/2017,34,5,0\r\n'}

In [51]:
df = pd.read_csv(io.StringIO(uploaded['latest_weather_data.csv'].decode('utf-8')))
df

        day    temp windspeed  event
0  1/1/2017    32 F     6 mph   Rain
1  1/2/2017  -99999     7 mph  Sunny
2  1/3/2017      28    -99999   Snow
3  1/4/2017  -99999         7      0
4  1/5/2017    32 C    -88888   Rain
5  1/6/2017      31         2  Sunny
6  1/6/2017      34         5      0

In [52]:
#now i want to replace these -99999 values to NAN
new_df = df.replace(-99999,np.NAN) #now take replace method,replace method take 2 parameter to replace values
new_df
#this method is used for 1 special values

        day    temp windspeed  event
0  1/1/2017    32 F     6 mph   Rain
1  1/2/2017  -99999     7 mph  Sunny
2  1/3/2017      28    -99999   Snow
3  1/4/2017  -99999         7      0
4  1/5/2017    32 C    -88888   Rain
5  1/6/2017      31         2  Sunny
6  1/6/2017      34         5      0

In [53]:
#but if i have 2 special values then use list values
new_df = df.replace([-99999,-88888],np.NAN) #now take replace method,replace method take 2 parameter to replace values and 1 list for 2 special values
new_df

        day    temp windspeed  event
0  1/1/2017    32 F     6 mph   Rain
1  1/2/2017  -99999     7 mph  Sunny
2  1/3/2017      28    -99999   Snow
3  1/4/2017  -99999         7      0
4  1/5/2017    32 C    -88888   Rain
5  1/6/2017      31         2  Sunny
6  1/6/2017      34         5      0

In [54]:
#new_df = df.replace([-99999,-88888,0],np.NAN) #now take replace method,replace method take 2 parameter to replace values and 1 list for 2 special values
#new_df
#if i use this method but it will be wrong bcz it goes and replacing all values to be none
#so use Dictionary which take the specific col
new_df = df.replace({
    'temp': -99999,
    'windspeed': [-99999,-88888],
    'event' : '0'
},np.NaN)
new_df

        day    temp windspeed  event
0  1/1/2017    32 F     6 mph   Rain
1  1/2/2017  -99999     7 mph  Sunny
2  1/3/2017      28    -99999   Snow
3  1/4/2017  -99999         7    NaN
4  1/5/2017    32 C    -88888   Rain
5  1/6/2017      31         2  Sunny
6  1/6/2017      34         5    NaN

In [55]:
#now mapping , means replace the values with new values
new_df = df.replace({
    -99999:np.NaN,
    -88888:np.NaN,
    '0': 'Sunny'
})
new_df

        day    temp windspeed  event
0  1/1/2017    32 F     6 mph   Rain
1  1/2/2017  -99999     7 mph  Sunny
2  1/3/2017      28    -99999   Snow
3  1/4/2017  -99999         7  Sunny
4  1/5/2017    32 C    -88888   Rain
5  1/6/2017      31         2  Sunny
6  1/6/2017      34         5  Sunny

In [57]:
#now chouping these unit into simple form. then use regex means regular expression
#they are just use to pattern.whenever u want to replace pattern with some other value then use regex.
#A to Z replace blank value and regex should be true
new_df = df.replace('[A-Za-z]','',regex=True) #now my 1st argument will be regex 
new_df
#it all worked but entire column of event erased bcz all of the event in alphabatical column

        day    temp windspeed event
0  1/1/2017     32         6
1  1/2/2017  -99999        7
2  1/3/2017      28    -99999
3  1/4/2017  -99999         7     0
4  1/5/2017     32     -88888
5  1/6/2017      31         2
6  1/6/2017      34         5     0

In [58]:
#now resolve this event problem use dictionary
new_df = df.replace({
    'temp': '[A-Za-z]',
    'windspeed': '[A-Za-z]',
},'',regex=True)
new_df

        day    temp windspeed  event
0  1/1/2017     32         6    Rain
1  1/2/2017  -99999        7   Sunny
2  1/3/2017      28    -99999   Snow
3  1/4/2017  -99999         7      0
4  1/5/2017     32     -88888   Rain
5  1/6/2017      31         2  Sunny
6  1/6/2017      34         5      0

In [59]:
#last thing we have to cover.How we replace the list with another list of value
#we have different dataFrame
df = pd.DataFrame({
    'score':['exceptional','average','good','poor','average','exceptional'],
    'student':['rob','maya','parthiv','tom','julian','erica']
})
df

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor      tom
4      average   julian
5  exceptional    erica

In [62]:
#i want to replace these alphabatic with vlues
new_df = df.replace(['poor','average','good','exceptional'], [1,2,3,4])
new_df

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1      tom
4      2   julian
5      4    erica